[
    {
        "hook": "Why did Hitler commit suicide?",
        "punchline": "Because he saw the gas bill"
    },
    {
        "hook": "Suicide Jokes are never funny.",
        "punchline": "I swear to god I'm gonna shoot myself if I see another one hit the front page."
    },
    {
        "hook": "Why did the fisherman commit suicide when the last dolphin died?",
        "punchline": "Because his life had no porpoise."
    },
    {
        "hook": "I'm not worried about Muslim suicide bombers",
        "punchline": "They can only do it once. Those Hindu suicide bombers are the real threat."
    },
    {
        "hook": "What would a character from the Star Wars universe shout before a suicide bombing?",
        "punchline": "ADMIRAL ACKBAR!"
    },
    {
        "hook": "What do you call a suicide bomber that can tell the future?",
        "punchline": "A tarot-ist"
    },
    {
        "hook": "Why did the quasar commit suicide?",
        "punchline": "The oscillation was too much to bear"
    },
    {
        "hook": "Why did Henri Lautrec contemplate suicide?",
        "punchline": "Thought he had nothing else Toulouse."
    },
    {
        "hook": "Why did the Sicilian call the suicide hotline?",
        "punchline": "To place an order."
    },
    {
        "hook": "How do you make a walrus commit suicide?",
        "punchline": "Point at its chest and say 'What's that?'"
    },
    {
        "hook": "My local library refuses to stock how-to books about suicide.",
        "punchline": "They used to, but the decent ones were never returned."
    },
    {
        "hook": "How do Russians commit suicide?",
        "punchline": "With two bullets to the back of the head."
    },
    {
        "hook": "How do homeopaths do suicide?",
        "punchline": "With a fatal underdose."
    },
    {
        "hook": "Popular celebrity survives suicide attempt.",
        "punchline": "BREAKING NOOSE!"
    },
    {
        "hook": "I am suicide bomber AMA",
        "punchline": "Wow this blew up fast."
    },
    {
        "hook": "Did you hear about the suicide bomber performing at the comedy open mic night?",
        "punchline": "He had everyone in pieces!"
    },
    {
        "hook": "Breaking News: Elderly nuns commit suicide by viagra overdose",
        "punchline": "Old habits die hard."
    },
    {
        "hook": "Why did the Heaven’s Gate Cult commit suicide?",
        "punchline": "They just wanted to keep up with the Joneses !"
    },
    {
        "hook": "I told my psychiatrist I'm thinking about suicide",
        "punchline": "He told me from now on I have to pay in advance."
    },
    {
        "hook": "A guy was wondering what being a suicide bomber was like",
        "punchline": "So I told him, \"C4 yourself\""
    },
    {
        "hook": "Why did the chicken commit suicide?",
        "punchline": "To get to the other side"
    },
    {
        "hook": "I called a suicide hotline in Iraq..",
        "punchline": "They got excited and asked if I could drive a truck."
    },
    {
        "hook": "How do you know all suicide bombers self identify as being old?",
        "punchline": "They are all boomers in the end"
    },
    {
        "hook": "I hate when people don't leave a suicide note.",
        "punchline": "Would it kill them to write few sentences?"
    },
    {
        "hook": "Why did Logan Paul go to the suicide forest?",
        "punchline": "To kill his career."
    },
    {
        "hook": "She was what we used to call a suicide blonde",
        "punchline": "dyed by her own hand."
    },
    {
        "hook": "Why are jokes about suicide bombers are not funny.",
        "punchline": "Well for starters, their delivery is just everywhere."
    },
    {
        "hook": "I don't know why I got fired from the suicide hotline...",
        "punchline": "I was doing a great job. They never called back for more help"
    },
    {
        "hook": "The problem with suicide jokes",
        "punchline": "Is they end abruptly"
    },
    {
        "hook": "How can you tell if being a suicide bomber really guarantees you blessings in the afterlife?",
        "punchline": "You have to C4 yourself"
    },
    {
        "hook": "There's a full proof way to prevent suicide",
        "punchline": "Push them, then it's homicide"
    },
    {
        "hook": "I don't see why you would become an Islamic fundamentalist suicide bomber on the off chance that when you die you get 72 virgins.",
        "punchline": "Just become a Catholic priest and get them now."
    },
    {
        "hook": "Where do suicide bombers go after they die?",
        "punchline": "Everywhere."
    },
    {
        "hook": "How do you know a blonde has been trying to commit suicide?",
        "punchline": "There are bullet holes in the mirror."
    },
    {
        "hook": "My girlfriend and I planned to commit suicide together...",
        "punchline": "... But once she killed herself, things started looking a lot more positive."
    },
    {
        "hook": "Guy walks into a library and asks the librarian for a book on committing suicide",
        "punchline": "She responds \"fuck off, you won't bring it back\""
    },
    {
        "hook": "The Suicide prevention hotline in my country is truly a life saver.",
        "punchline": "I waited for a long time for them to pick up, I fell asleep and woke up without sucidal thoughts."
    },
    {
        "hook": "A suicide bomber training his new recruits:",
        "punchline": "\"Okay, pay attention, I'm only going to show you this once\""
    },
    {
        "hook": "What would a suicide bomber die for?",
        "punchline": "A blowjob"
    },
    {
        "hook": "Why did the mathematician commit suicide?",
        "punchline": "Because he had too many problems."
    },
    {
        "hook": "Why is suicide illegal in China?",
        "punchline": "Destruction of government property"
    },
    {
        "hook": "I tried to make a suicide joke",
        "punchline": "The room was dead silent"
    },
    {
        "hook": "If your surprised that Jeffrey Epstein commited suicide this morning",
        "punchline": "Imagine how surprised he must have been."
    },
    {
        "hook": "I accidentally dialed a suicide hotline in Saudi Arabia.",
        "punchline": "The first question they asked was if I knew how to fly a plane."
    },
    {
        "hook": "What's suicide bombers' biggest fear?",
        "punchline": "Dying alone"
    },
    {
        "hook": "When you make a suicide pact with someone, NEVER offer to go first.",
        "punchline": "Trust me. I’ve done like five of them."
    },
    {
        "hook": "Suicide booths are 50% off",
        "punchline": "Its a deal to die for."
    },
    {
        "hook": "why don’t libraries have books about suicide?",
        "punchline": "They don’t get returned."
    },
    {
        "hook": "A suicide bomb instructor is training a class.",
        "punchline": "Ok!! Everybody! Pay very close attention now! I can only demonstrate this once!!!"
    },
    {
        "hook": "Suicide?",
        "punchline": "That's the last thing I'd ever do."
    },
    {
        "hook": "Depression/suicide jokes are basically yo mama jokes of our generation — they're lazy, unfunny and useless",
        "punchline": "Just like me"
    },
    {
        "hook": "The only person that keeps me from commiting suicide",
        "punchline": "is that guy instantly upvoting anything I post."
    },
    {
        "hook": "My mum told me to stop telling the suicidal jokes.",
        "punchline": "I replied with: Don't worry, suicide would be the last thing I'd do."
    },
    {
        "hook": "When is the best time to commit suicide?",
        "punchline": "Ate a glock in the morning."
    },
    {
        "hook": "Suicide is not a joke, get help",
        "punchline": "You can pay someone to shoot you"
    },
    {
        "hook": "I've realized that suicide would solve all my problems....",
        "punchline": "...if I could just get the right people to try it."
    },
    {
        "hook": "Hey girl, are you suicide?",
        "punchline": "Cause I think of you everyday."
    }
]
